{
    "SetDevConf": "Конфигурация устройства",
    "SetDevPreset": "Выберите из списка подходящий пресет кофигурации",

    "ButSave":"Сохранить",
    "ButMainPage":"Главная",


    "SetUDPList": "Список других устройств в сети:",
    "SetUDPWarn1": "После нажатия на кнопку <b>переформировать список устройств</b> ждите примерно минуту, а затем обновите страницу и список появится вновь",

    "SetUDPUpdateList":"Переформировать список устройств",
    "SetUDPUpdatePage":"Обновить страницу",
    "SetUDPNameOfDev":"Имя этого устройства:",
    "SetUDPDateExchange":"Включить обмен данными между устройствами",
    "SetUDPWarn2":"Если обмен данными включен, то устройства будут обмениваться широковещательными пакетами udp для формирования списка устройств и для осуществления посылки настроек mqtt. Данный обмен создает дополнительную нагрузку на wifi сеть.",

    "SetWiFiNameOfDev":"Имя устройства:",
    "SetWiFiRouterConnect":"Подключение к WiFi роутеру:",
    "SetWiFiAccessPoint":"Точка доступа:",
    "SetWiFiWeb":"Логин и пароль web interface:",
    "SetWiFiTimeZone":"Временная зона:",
    "SetWiFiNTP":"Сервер NTP:",
    "SetWiFiWarn1":"Имя устройства должно состоять из английских букв и иметь длинну от 6 до 12 символов",
    "SetWiFiWarn2":"После того как вы введете логин пароль от вашего wifi роутера необходимо нажать кнопку сохранить, а затем обязательно нажать кнопку <b>перезагрузить устройство</b> внизу этой страницы",
    "SetWiFiWarn3":"Устройство постоянно сканирует сеть на наличие wifi. Если роутер отключен, то устройство автоматически перейдет в режим точки доступа. Когда wifi появится устройство автоматически подключится к роутеру снова, и выключит точку доступа",
    "SetWiFiWarn4":"После изменения поля <b>NTP сервер</b> необходимо перезагрузить устройство",

    "SetMQTTServerName":"Имя сервера:",
    "SetMQTTPort":"Номер порта:",
    "SetMQTTPrefix":"Префикс:",
    "SetMQTTUserName":"Имя пользователя:",
    "SetMQTTPassword":"Пароль:",

    "SetMQTTSendSettings":"Отправить настройки MQTT с этого устройства на все остальные",
    "SetMQTTWarn1":"Обратите внимание что поле префикс может состоять только из одного слова и одного разделителя: <b>/prefix</b>, вариант вида: <b>/prefix1/prefix2</b> работать не будет. После изменения поля prefix необходимо перезагрузить устройство",
    "SetMQTTWarn2":"Прежде чем нажимать на кнопку <b>Отправить настройки MQTT</b> сохрание их, если Вы их меняли. Настройки получат и перезапишут все устройства в локальной сети"
}